{"text":"Isaiah Hansen \n\nEmail: isaiah1hansen@gmail.com\n\nLinkedIn: https://www.linkedin.com/in/isaiah-hansen-a23936311 | GitHub: https://github.com/KeelerZoroth | Portfolio: https://isaiah-hansen-portfolio.netlify.app/\n\n\n\nSummary\n\nExperienced front-end web developer specializing in building interactive and responsive user interfaces. Proficient in HTML, CSS, JavaScript, and modern frameworks such as React and TypeScript. Demonstrated ability to contribute to collaborative projects with strong problem-solving skills and attention to code quality, including comprehensive use of Bootstrap. Adept at leveraging version control systems like Git and working effectively with development tools such as Visual Studio Code and Postman. Successfully led and executed key roles on project teams, including full page structuring and responsive design integration. Recognized for clear code documentation and implementation in web development projects. Completed extensive web development training through SMU's Full Stack Web Development Boot Camp and supplemental coursework in JavaScript programming.\n\n\n\n\n\nTechnical Skills\n\nTechnical Languages: HTML, CSS, JavaScript, TypeScript\n\n\n\nTools & Technologies: Visual Studio Code, Postman, Chrome DevTools, Bootstrap, jQuery, Git, GitHub, Node.js, npm, React.js, Express.js, PostgreSQL (with Sequelize), MongoDB (with Mongoose), GraphQL, Cypress\n\nProjects\n\nSnippet | GitHub: https://github.com/KeelerZoroth/Portfolio | Site: https://snippet-vzjo.onrender.com/\n\nSummary: For programmers to search for small bits of code, or have their own code explained by AI. Using the ChatGPT API to appraise code, it stores the code snippet along with a title and summary for others to use later.\n\nResponsibilities: Project Setup and Deployment, AI API, authentication, code review\n\nTools and Languages: ChatGPT API, React.js, CSS, TypeScript, Express.js, MongoDB, GitHub Actions, Visual Studio Code\n\n\n\nGroup Calendar | GitHub: https://github.com/KeelerZoroth/Group-Calendar | Site: https://group-calendar-a5hu.onrender.com/\n\nSummary: For event management, allowing involvement in multiple groups to have one place to view it all.\n\nResponsibilities: Project Setup and Deployment, Project Lead, Backend, API, authentication, review and fix code\n\nTools and Languages: React.js, CSS, TypeScript, Express.js, PostgreSQL, Visual Studio Code\n\n\n\nParty Planner | GitHub: https://github.com/angiethelibrarian/Party-Planner-Project1 | Not deployed\n\nSummary: For organizing guests and their delegated tasks, this site is meant be used by someone hosting an event.\n\nResponsibilities: complete HTML Page, starter CSS code, page responsiveness, implement Bootstraps, cleanup and commenting code\n\nTools and Languages: HTML, CSS, JavaScript, Bootstraps, Visual Studio Code\n\n\n\nExperience \n\nEmployee Instore\t\t\t                                                                                                  2023 – 2025\n\nPapa John’s                                                                                                                                     Aubery, Texas\n\nWorked in a high-volume, fast-paced environment where I enhanced customer experiences and streamlined operational processes. Collaborated with a team to ensure order accuracy, on-time delivery, and maintained efficiency in daily operations. Applied strong problem-solving skills to resolve customer issues quickly and effectively, ensuring satisfaction and retention.\n\n\n\nEducation\n\nFull Stack Web Development Boot Camp Certificate: SMU, Online \n\nAn intensive program focused on gaining technical programming skills in HTML5, CSS3, JavaScript, TypeScript, Node.js, npm, Express, ReactJS, MySQL, MongoDB, and GraphQL.\n\n\n\nComputer programming - JavaScript and the web: Khan Acadamy, Online\n\nFocused on web development and JavaScript, covering key concepts such as interactive web pages, functions, DOM manipulation, and basic algorithms. Gained a foundational understanding of the elements in web programming.\n\n"}